// 按位非 任何数字x的结果为 -(x+1)
// console.log(~5) // -6
// console.log(~0) // -1
// console.log(~1) // -2
// console.log(~-23) // 22
// 按位与 任何数字x,y x,y的对应位都是1则为1,否则为0
// 8->1000
// 6-> 0110
// 得0000
// console.log(8 & 6) //0
// 按位与赋值 任何数字x,y的二进制操作数按位与后赋值给变量
// let a = 9
// a &= 3
// console.log(a) // 1
// 按位或 任何数字x,y的二进制位对应只要一个是1则为1
// 6->110
// 3->011
// 7->111
// console.log(6|3) // 7
// 按位或赋值 原理同按位与赋值
// 按位异或 任何数字x,y的二进制位对应都是1则为0 都是0则为0 0 1则为1
// console.log(6 ^ 3) // 5
// 按异或赋值 原理同按位与赋值
// 零填充位运算左移 任何数字x向左移动y位  x=x*2**y
// console.log(6 << 4) // 96
// console.log(6 >> 4)
// 有符合位运算右移
// -7
// -7 -> 00000111 -> 11111000 -> 11111001 -> 11111110 -2
// console.log(-7>>2) // -2
// 零填充位运算右移
// 7 -> 00000111 -> 00000001 -> 1
// console.log(7>>2) // 1
// 零填充右移
// 7 - 00000111 -> 0000001 -> 1
// console.log(7>>>2) // 1